tests/load/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load phase"
    - duration: 60
      arrivalRate: 20
      name: "Peak load phase"
    - duration: 60
      arrivalRate: 5
      name: "Cool down phase"
  
  # HTTP 설정
  http:
    timeout: 30
    pool: 10
  
  # 결과 저장
  processor: "./load-test-processor.js"
  
  # 환경별 설정
  environments:
    development:
      target: 'http://localhost:3000'
      phases:
        - duration: 30
          arrivalRate: 2
          name: "Dev load test"
    
    staging:
      target: 'https://staging.unecorail.com'
      phases:
        - duration: 120
          arrivalRate: 15
          name: "Staging load test"
    
    production:
      target: 'https://unecorail.com'
      phases:
        - duration: 300
          arrivalRate: 25
          name: "Production load test"

# 시나리오 정의
scenarios:
  # 메인 페이지 로드 테스트
  - name: "Main Page Load"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - responseTime: 2000
      - think: 2
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - responseTime: 1000

  # 재고 관리 페이지 테스트
  - name: "Stock Management"
    weight: 25
    flow:
      - get:
          url: "/stock-management"
          expect:
            - statusCode: 200
            - responseTime: 3000
      - think: 3
      - get:
          url: "/api/stock/current"
          expect:
            - statusCode: 200
            - responseTime: 1500
      - think: 2

  # API 엔드포인트 테스트
  - name: "API Endpoints"
    weight: 20
    flow:
      - get:
          url: "/api/stock/current"
          expect:
            - statusCode: 200
            - responseTime: 2000
      - think: 1
      - get:
          url: "/api/stock/history"
          expect:
            - statusCode: 200
            - responseTime: 2500
      - think: 2

  # 검색 기능 테스트
  - name: "Search Functionality"
    weight: 15
    flow:
      - get:
          url: "/api/stock/search?query=전선"
          expect:
            - statusCode: 200
            - responseTime: 2000
      - think: 2
      - get:
          url: "/api/stock/search?query=케이블"
          expect:
            - statusCode: 200
            - responseTime: 2000

  # 인증 테스트
  - name: "Authentication"
    weight: 10
    flow:
      - get:
          url: "/api/auth/status"
          expect:
            - statusCode: 200
            - responseTime: 1000
      - think: 1
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser"
            password: "testpass"
          expect:
            - statusCode: [200, 401]
            - responseTime: 2000

# 성능 기준
expectations:
  - http:
      statusCode: 200
      responseTime: 3000
      maxErrorRate: 5
  - http:
      statusCode: 500
      maxErrorRate: 1